Documents/ПополнениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПополнениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаличных</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиБезналичных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПополнениеДенег/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьПоляОплаты();

КонецПроцедуры


&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)

	ОбновитьПоляОплаты();

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПоляОплаты()

	Если Элементы.Найти("Касса") = Неопределено
		Или Элементы.Найти("БанковскийСчет") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.СпособОплаты) Тогда
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Наличная") Тогда
		
		Элементы.Касса.Видимость = Истина;
		Элементы.БанковскийСчет.Видимость = Ложь;
		Объект.БанковскийСчет = Неопределено;
		
	ИначеЕсли Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Безналичная")
		Или Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Онлайн") Тогда
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Истина;
		Объект.Касса = Неопределено;
		
	Иначе
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры
